# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv5 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov5
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
ch: 6
scales: # model compound scaling constants, i.e. 'model=yolov5n.yaml' will call yolov5.yaml with scale 'n'
  # [depth, width, max_channels]
  # n: [0.33, 0.25, 1024]
  # s: [0.33, 0.50, 1024]
  # m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  # x: [1.33, 1.25, 1024]

# YOLOv5 v6.0 backbone
backbone:
  - [-1, 1, IdentityInput, []] # 0
  - [-1, 1, ModalitySelector, [1]] # 1 RGB
  - [-2, 1, ModalitySelector, [2]] # 2 IR

  # [from, number, module, args]
  - [1, 1, Conv, [64, 6, 2, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C3, [128]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C3, [256]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 9, C3, [512]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C3, [1024]]
  - [-1, 1, SPPF, [1024, 5]] # 9

    # [from, number, module, args]
  - [2, 1, Conv, [64, 6, 2, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C3, [128]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C3, [256]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 9, C3, [512]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C3, [1024]]
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  - [[7, 17], 1, AWF, [256, 80]]   # 23: Fused P3/8
  - [[9, 19], 1, AWF, [512, 40]]   # 24: Fused P4/16
  - [[12, 22], 1, AWF, [1024, 20]] # 25: Fused P5/32

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 26: Upsample Fused P5
  - [[-1, 24], 1, Concat, [1]] # 27: cat with Fused P4 (Index 24)
  - [-1, 3, C3, [512, False]]  # 28

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 29: Upsample again
  - [[-1, 23], 1, Concat, [1]] # 30: cat with Fused P3 (Index 23)
  - [-1, 3, C3, [256, False]]  # 31: (P3/8-small output)

  - [-1, 1, Conv, [256, 3, 2]] # 32: Downsample P3
  - [[-1, 28], 1, Concat, [1]] # 33: cat with head P4 (Index 28)
  - [-1, 3, C3, [512, False]]  # 34: (P4/16-medium output)

  - [-1, 1, Conv, [512, 3, 2]] # 35: Downsample P4
  - [[-1, 25], 1, Concat, [1]] # 36: cat with Fused P5 (Index 25)
  - [-1, 3, C3, [1024, False]] # 37: (P5/32-large output)

  - [[31, 34, 37], 1, Detect, [nc]] # 38: Detect(P3, P4, P5)
